In [1]:
import pandas as pd

In [3]:
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L11/Lending-company.csv"
df = pd.read_csv(filename, usecols = ['StringID', 'Location', 'Region'], index_col = 'StringID' )
df.head()

             Location    Region
StringID
LoanID_1   Location 3  Region 2
LoanID_2   Location 6  Region 6
LoanID_3   Location 8  Region 3
LoanID_4  Location 26  Region 2
LoanID_5  Location 34  Region 3

In [2]:
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L11/Lending-company-single-column-data.csv"
df = pd.read_csv(filename, sep = '\,')

<ipython-input-2-ea13dd22aea4>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv(filename, sep = '\,')

In [6]:
#Para evitar la advertencia de python , definimos el engine
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L11/Lending-company-single-column-data.csv"
df = pd.read_csv(filename, sep = '\,', engine = 'python')
df.head()

,"""LoanID",StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,"LoanStatus"""
0,"""1",LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,"Active"""
1,"""2",LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,"Active"""
2,"""3",LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,""""
3,"""4",LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,"Active"""
4,"""5",LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,"Active"""

In [7]:
#Para evitar la advertencia de python , definimos el engine
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L11/Lending-company.csv"
df = pd.read_csv(filename)
df.head()

,LoanID,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
0,1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
1,2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
2,3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
3,4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
4,5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L21/Customer-Gender.csv"
df = pd.read_csv(filename)
df.head()

  CustomerGender
0         Female
1         Female
2           Male
3           Male
4         Female

In [11]:
# como este DataFrame contiene una sola columna , podemos usar el parámetro squeeze para obtenerlo como una Serie al importar
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L21/Customer-Gender.csv"
df = pd.read_csv(filename, squeeze = "CustomerGender")
df.head()

<ipython-input-11-d7c1158765f0>:3: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  df = pd.read_csv(filename, squeeze = "CustomerGender")

0    Female
1    Female
2      Male
3      Male
4    Female
Name: CustomerGender, dtype: object

In [12]:
type(df)

pandas.core.series.Series

In [15]:
# Si en su lugar tenemos muchas columnas y sólo queremos traer una como Series , importamos el documento con sólo esa columna
filename = "C:/Users/m.pirela.escobar/OneDrive - Accenture/Documents/Courses/Data_Analyst/Data Analyst Course/S10 - Working with Text Files/L11/Lending-company.csv"
df = pd.read_csv(filename, usecols = ['Product'], squeeze = True)
df.head()

<ipython-input-15-5a7f401b0d92>:3: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  df = pd.read_csv(filename, usecols = ['Product'], squeeze = True)

0    Product B
1    Product D
2    Product B
3    Product A
4    Product B
Name: Product, dtype: object

In [16]:
type(df)

pandas.core.series.Series